[문제]
회문(回文, palindrome)은 어떤 방향으로 읽어도 같은 문자열을 말한다. 예를 들면 “여보 안경 안 보여”, “다 큰 도라지라도 큰다.”, “아들딸이 다 컸다 이 딸들아”은 잘 알려진 회문이다.
이 경우 보통 낱말 사이에 있는 띄어쓰기나 문장 부호는 무시한다. 이번에는 영문 소문자 문자열만 다룬다. 예를 들어 ‘abba’ ‘kayak’, ‘reviver’, ‘madam’은 모두 회문이다.
만일 그 자체로는 회문이 아니지만 한 문자를 제거하여 회문으로 만들 수 있으면 이런 문자열을 “유사회문”(quasi palindrome)이라고 부른다.
예를 들어 ‘summuus’는 5번째나 혹은 6번째 문자 ‘u’를 제거하면 회문 ‘summus’이 되므로 이것은 유사회문이다.
여러분은 제시된 문자열이 그 자체로 회문인지, 또는 “유사회문”인지, 아니면 그 외 일반 문자열인지를 판단해야 한다. 

[입출력]
입력파일 palin.inp의 첫줄에는 정수, N 이 주어진다.
그 다음 이러지는 N개의 각 줄에는 소문자로 구성된 문자열이 하나씩 주어진다.
여러분은 이 문자열이 그 자체로 회문인지, 또는 ‘유사회문’인지, 또는 회문도 유사회문도 아닌지를 판명하여 그 결과를 1, 2, 3으로 구분하여 출력파일 palin.out에 순서대로 출력해야 한다.
입력 문자열의 길이 L 의 범위는 3 <= L <= 100000 이다. 
